Revit 2024 API
MasonryCMU Members
The MasonryCMU type exposes the following members.
Properties
Name | Description
CommonTintColor
 The property labeled "Tint Color" from the "MasonryCMU" schema.
CommonTintToggle
 The property labeled "Tint" from the "MasonryCMU" schema.
MasonryCMUApplication
 The property labeled "Finish" from the "MasonryCMU" schema.
MasonryCMUColor
 The property labeled "Color" from the "MasonryCMU" schema.
MasonryCMUColorByObject
 The property labeled "Color By Object" from the "MasonryCMU" schema.
MasonryCMUPattern
 The property labeled "Relief Pattern" from the "MasonryCMU" schema.
MasonryCMUPatternHeight
 The property labeled "Amount" from the "MasonryCMU" schema.
MasonryCMUPatternMap
 The property labeled "Image" from the "MasonryCMU" schema.
MasonryCMUType
 The property labeled "Type" from the "MasonryCMU" schema.
See Also
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace